In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [2]:
raw_csv_data=pd.read_csv("Index2018.csv")
df_com=raw_csv_data.copy()

# Length of the Time Period

In [5]:
df_com.date.describe()

count           6269
unique          6269
top       02/09/2005
freq               1
Name: date, dtype: object

# From text to date

In [8]:
df_com.date=pd.to_datetime(df_com.date,dayfirst=True)

In [10]:
df_com.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [11]:
df_com.date.describe()

<ipython-input-11-99e4e0d16302>:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df_com.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

# Setting the index

#### Each value corresponds to a time period. We often wish to examine specific chunks of data between two concrete dates.Separating the data before and after 2008. We need to use the associated time periods as indices

In [13]:
df_com.set_index("date",inplace=True)

In [14]:
df_com.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

# Setting the desired frequency

In [18]:
df_com=df_com.asfreq('b')

In [19]:
df_com.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

# Handling the Missing Data

In [20]:
df_com.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [22]:
df_com.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [23]:
df_com.spx=df_com.spx.fillna(method="ffill")

In [24]:
df_com.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [25]:
df_com.ftse=df_com.ftse.fillna(method="bfill")

In [26]:
df_com.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [27]:
df_com.dax=df_com.dax.fillna(value=df_com.dax.mean())

In [28]:
df_com.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [29]:
df_com.nikkei=df_com.nikkei.fillna(value=df_com.nikkei.mean())

In [30]:
df_com.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

# Simplifying the dataset

In [31]:
df_com['market_value']=df_com.spx

In [32]:
df_com.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6277.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   1288.642547
std     487.868210   2752.604984  1145.568370   4040.545253    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10711.090000    992.715221
50%    1233.761241   5774.380000  5663.300000  15014.040000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17858.420000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [33]:
del df_com['spx']

In [34]:
df_com.describe()

                dax         ftse        nikkei  market_value
count   6277.000000  6277.000000   6277.000000   6277.000000
mean    6080.063363  5423.690398  14597.055700   1288.642547
std     2752.604984  1145.568370   4040.545253    487.868210
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4070.460000  4487.880000  10711.090000    992.715221
50%     5774.380000  5663.300000  15014.040000   1233.761241
75%     7442.660000  6304.630175  17858.420000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

In [35]:
del df_com['dax'],df_com['ftse'],df_com['nikkei']

In [36]:
df_com.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

# Splitting the Data

In [37]:
size=int(len(df_com)*0.8)

In [38]:
df=df_com.iloc[:size]

In [39]:
df_test=df_com.iloc[size:]

In [40]:
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [42]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623